V1/Data/linkerd/60-4-wrk2-r2prf.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 53.676ms, rate sampling interval: 194ms
  Thread calibration: mean lat.: 39.660ms, rate sampling interval: 155ms
  Thread calibration: mean lat.: 43.381ms, rate sampling interval: 177ms
  Thread calibration: mean lat.: 52.314ms, rate sampling interval: 201ms
  Thread calibration: mean lat.: 44.459ms, rate sampling interval: 195ms
  Thread calibration: mean lat.: 43.728ms, rate sampling interval: 185ms
  Thread calibration: mean lat.: 46.398ms, rate sampling interval: 191ms
  Thread calibration: mean lat.: 49.611ms, rate sampling interval: 188ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.17ms   60.55ms 426.75ms   95.27%
    Req/Sec     2.42     15.45   162.00     97.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   15.90ms
 75.000%   23.07ms
 90.000%   43.01ms
 99.000%  389.12ms
 99.900%  421.89ms
 99.990%  426.49ms
 99.999%  427.01ms
100.000%  427.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       7.267     0.000000            1         1.00
      11.095     0.100000          565         1.11
      12.143     0.200000         1127         1.25
      13.119     0.300000         1691         1.43
      14.271     0.400000         2254         1.67
      15.895     0.500000         2814         2.00
      16.975     0.550000         3097         2.22
      18.127     0.600000         3376         2.50
      19.871     0.650000         3657         2.86
      21.487     0.700000         3940         3.33
      23.071     0.750000         4221         4.00
      23.935     0.775000         4363         4.44
      25.119     0.800000         4501         5.00
      26.607     0.825000         4645         5.71
      28.863     0.850000         4784         6.67
      32.383     0.875000         4923         8.00
      35.039     0.887500         4994         8.89
      43.295     0.900000         5064        10.00
      51.871     0.912500         5134        11.43
      63.679     0.925000         5206        13.33
      75.327     0.937500         5275        16.00
      82.367     0.943750         5311        17.78
      88.191     0.950000         5345        20.00
      94.463     0.956250         5380        22.86
     103.039     0.962500         5416        26.67
     118.015     0.968750         5451        32.00
     135.295     0.971875         5468        35.56
     324.351     0.975000         5486        40.00
     343.295     0.978125         5503        45.71
     354.559     0.981250         5521        53.33
     369.663     0.984375         5539        64.00
     375.295     0.985938         5547        71.11
     381.183     0.987500         5556        80.00
     386.303     0.989062         5565        91.43
     391.935     0.990625         5574       106.67
     397.311     0.992188         5583       128.00
     399.615     0.992969         5587       142.22
     403.711     0.993750         5591       160.00
     406.527     0.994531         5596       182.86
     409.087     0.995313         5600       213.33
     410.879     0.996094         5605       256.00
     411.903     0.996484         5607       284.44
     412.671     0.996875         5609       320.00
     413.439     0.997266         5611       365.71
     414.975     0.997656         5613       426.67
     419.583     0.998047         5616       512.00
     420.863     0.998242         5617       568.89
     421.631     0.998437         5618       640.00
     421.887     0.998633         5621       731.43
     421.887     0.998828         5621       853.33
     421.887     0.999023         5621      1024.00
     422.655     0.999121         5622      1137.78
     422.655     0.999219         5622      1280.00
     424.191     0.999316         5623      1462.86
     424.191     0.999414         5623      1706.67
     426.495     0.999512         5625      2048.00
     426.495     0.999561         5625      2275.56
     426.495     0.999609         5625      2560.00
     426.495     0.999658         5625      2925.71
     426.495     0.999707         5625      3413.33
     426.495     0.999756         5625      4096.00
     426.495     0.999780         5625      4551.11
     426.495     0.999805         5625      5120.00
     427.007     0.999829         5626      5851.43
     427.007     1.000000         5626          inf
#[Mean    =       31.173, StdDeviation   =       60.545]
#[Max     =      426.752, Total count    =         5626]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6008 requests in 5.00m, 2.22MB read
  Socket errors: connect 0, read 0, write 0, timeout 24000
Requests/sec:     20.03
Transfer/sec:      7.57KB