V1/Data/linkerd/600-3-wrk2-x692j.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 61.106ms, rate sampling interval: 180ms
  Thread calibration: mean lat.: 61.068ms, rate sampling interval: 184ms
  Thread calibration: mean lat.: 60.803ms, rate sampling interval: 182ms
  Thread calibration: mean lat.: 62.278ms, rate sampling interval: 182ms
  Thread calibration: mean lat.: 63.532ms, rate sampling interval: 190ms
  Thread calibration: mean lat.: 61.336ms, rate sampling interval: 182ms
  Thread calibration: mean lat.: 62.508ms, rate sampling interval: 190ms
  Thread calibration: mean lat.: 61.645ms, rate sampling interval: 188ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    65.59ms   22.58ms 176.64ms   70.62%
    Req/Sec    24.90     45.82   139.00     82.11%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   66.82ms
 75.000%   79.81ms
 90.000%   91.20ms
 99.000%  128.32ms
 99.900%  160.90ms
 99.990%  173.31ms
 99.999%  176.51ms
100.000%  176.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       6.615     0.000000            1         1.00
      36.799     0.100000         5797         1.11
      46.175     0.200000        11595         1.25
      54.271     0.300000        17401         1.43
      60.927     0.400000        23179         1.67
      66.815     0.500000        29026         2.00
      69.439     0.550000        31870         2.22
      72.063     0.600000        34781         2.50
      74.559     0.650000        37664         2.86
      77.119     0.700000        40567         3.33
      79.807     0.750000        43481         4.00
      81.215     0.775000        44894         4.44
      82.879     0.800000        46356         5.00
      84.543     0.825000        47783         5.71
      86.463     0.850000        49248         6.67
      88.703     0.875000        50714         8.00
      89.855     0.887500        51401         8.89
      91.199     0.900000        52129        10.00
      92.863     0.912500        52870        11.43
      94.655     0.925000        53575        13.33
      96.959     0.937500        54308        16.00
      98.303     0.943750        54663        17.78
      99.903     0.950000        55030        20.00
     101.823     0.956250        55387        22.86
     103.871     0.962500        55755        26.67
     106.815     0.968750        56109        32.00
     108.479     0.971875        56295        35.56
     110.143     0.975000        56469        40.00
     112.319     0.978125        56649        45.71
     115.135     0.981250        56829        53.33
     118.655     0.984375        57011        64.00
     120.831     0.985938        57100        71.11
     123.455     0.987500        57195        80.00
     126.207     0.989062        57281        91.43
     129.535     0.990625        57374       106.67
     134.143     0.992188        57468       128.00
     136.319     0.992969        57509       142.22
     138.751     0.993750        57553       160.00
     140.927     0.994531        57598       182.86
     144.255     0.995313        57643       213.33
     146.815     0.996094        57688       256.00
     148.351     0.996484        57711       284.44
     149.759     0.996875        57736       320.00
     151.807     0.997266        57758       365.71
     153.599     0.997656        57780       426.67
     155.263     0.998047        57802       512.00
     156.031     0.998242        57813       568.89
     157.567     0.998437        57824       640.00
     158.847     0.998633        57836       731.43
     159.999     0.998828        57847       853.33
     161.023     0.999023        57858      1024.00
     161.535     0.999121        57864      1137.78
     162.943     0.999219        57869      1280.00
     163.839     0.999316        57875      1462.86
     164.863     0.999414        57881      1706.67
     166.015     0.999512        57886      2048.00
     166.911     0.999561        57890      2275.56
     167.679     0.999609        57892      2560.00
     168.191     0.999658        57895      2925.71
     169.215     0.999707        57898      3413.33
     169.471     0.999756        57900      4096.00
     170.111     0.999780        57902      4551.11
     171.519     0.999805        57903      5120.00
     171.775     0.999829        57905      5851.43
     172.159     0.999854        57906      6826.67
     172.415     0.999878        57907      8192.00
     173.311     0.999890        57909      9102.22
     173.311     0.999902        57909     10240.00
     174.207     0.999915        57910     11702.86
     174.207     0.999927        57910     13653.33
     174.335     0.999939        57911     16384.00
     174.335     0.999945        57911     18204.44
     175.103     0.999951        57912     20480.00
     175.103     0.999957        57912     23405.71
     175.103     0.999963        57912     27306.67
     176.511     0.999969        57913     32768.00
     176.511     0.999973        57913     36408.89
     176.511     0.999976        57913     40960.00
     176.511     0.999979        57913     46811.43
     176.511     0.999982        57913     54613.33
     176.767     0.999985        57914     65536.00
     176.767     1.000000        57914          inf
#[Mean    =       65.588, StdDeviation   =       22.584]
#[Max     =      176.640, Total count    =        57914]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60008 requests in 5.00m, 22.15MB read
Requests/sec:    200.00
Transfer/sec:     75.59KB